;; -*- no-byte-compile: t; -*-

(package! vlf)
(package! engine-mode)
(package! eacl)
(package! beacon)
(package! fancy-narrow)
(package! dash-at-point)
(package! json-snatcher)
;; (package! evil-ediff)
(package! hl-anything)
;; (package! evil-replace-with-register)
(package! logview)
(package! origami)
(package! lentic)
(package! nov)
(package! move-text)
;; (package! evil-visual-mark-mode)
(package! wand)
(package! deft)
(package! suggest)
;; (package! counsel-etags)
;; (package! counsel-dash)
(package! yankpad)

(package! esup)


;; (package! lispy)
;; (package! lispyville)
;; (package! ox-clip)
;; (package! ox-ipynb)
(package! tldr)
(package! visual-regexp)
(package! visual-regexp-steroids)
(package! atomic-chrome)
(package! paperless)

;; (package! solarized-theme)
;; (package! color-theme-sanityinc-tomorrow)
;; (package! zenburn-theme)
;; (package! monokai-theme)
;; https://github.com/bmag/emacs-purpose

;; https://github.com/jorgenschaefer/elpy

;; https://github.com/abo-abo/make-it-so
;; https://github.com/vspinu/imenu-anywhere
;; https://github.com/realgud/realgud
;; https://github.com/jorgenschaefer/pyvenv
;; https://github.com/paetzke/py-yapf.el
;; https://github.com/ionrock/pytest-el

;; https://github.com/google/yapf

;; not very useful, buffer disappeared after window close and can't get back
;; (package! scratch-el :recipe (:fetcher github :repo "ieure/scratch-el"))
;; seems have some issue with evil mode
;; (package! json-navigator :recipe (:fetcher github :repo "DamienCassou/json-navigator"))

;; not quite working for me, ob-ipython seems better
;; https://github.com/millejoh/emacs-ipython-notebook
;; (package! ein)

;; this does not work..
;;(package! org-ehtml)

;; couldn't get it installed on emacs 26
;; (package! org-preview-html)
;; (package! org-preview-html :recipe (:fetcher github :repo "lujun9972/org-preview-html"))

;; couldn't get it working properly on mac
;; (package! camcorder)

;; elpy seems better suits me
;; https://github.com/proofit404/anaconda-mode
